Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: ཨ་བི་རུད་དྷེ་ས་ཧི་ཏ་ཨརྠེ། ཨརྠ་སིདྡྷེ། ཨ་མྲྀ་ཏ་བ་ཏེ། སཱ་ག་རེ། སཱ་ག་ར་བ་ཏི། ཨ་བྷི་དེ། བཛྲ་སནྡྷི། ཨཀྵ་ཡེ། ཨཀྵ་ཏ་པྲ་བྷེ། ཛཱ་ཏི་བི་ཤོ་དྷ་ནེ། ཤུདྡྷེ། ཤུདྡྷེ། ཨ་བ་བྷཱ་ས་བ་ཏི། ས་མ་པྲ་ཡོ་གེ། ས་མ་ཙི་ཏེ། ཨ་ནུཏྟ་རེ། བུདྡྷ་ཨ་དྷི་ཥྛཱ་ནེ། ཤཱི་ལ་བི་ཤོ་དྷ་ནེ། ཨནྟི་ཀྲ་མ་ཎེ། ཨ་སཾ་ཧཱ་རྱེ།
en: Tadyathā / abhaye bhayavigate bhayaviśodhane abhayadāde nirupadrave anākule ākulasamśodhane agrahe avivāde akalpe acyutte śubhateje tejovati mahāteje upaśāme maitryungate śoṣayamāne satyadarṣaṇe aviruddhesahitārthe arthasiddhe amṛtavate sāgare sāgaravati abhide vajrasandhi akṣaye akṣataprabhe jātiviśodhane śuddhe śuddhe avabhāsavati samaprayoge samacite anuttare buddhādhiṣṭhāne śīlavaśodhane antikramaṇe asamhārye nigṛhītammāravalam parājayodhrṣṭigatānām jvalānāmdharmolkānām samgṛhītāna dharmatānām udghaṭīnām dharmanidhānān

source: ནི་གྲྀ་ཧཱི་ཏཾ་མཱར་བ་ལམ། པ་རཱ་ཛ་ཡོ་བྷྲྀ་ཥྚི་ག་ཏཱ་ནཱཾ། ཛྭ་ལྔ་ནཱཾ་དྷ་རྨོ་ལྐཱ་ནཱཾ། སཾ་གྲྀ་ཧཱི་ཏཱ་ན།
en: “Kauśika, these are the words of the mantra, the secret mantra.

source: དྷ་རྨ་ཏཱ་ནཱཾ། ཨུངྒྷ་ཊཱི་ནཾ། དྷརྨ་ནི་དྷཱ་ནཱན། ཀཽ་ཤི་ཀ་རིག་སྔགས་དང་། གསང་སྔགས་ཀྱི་གཞི་ནི་འདི་དག་ཡིན་ཏེ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་རྣམས་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་གསུངས་སོ།
en: They have been spoken so that the sublime Dharma of the buddhas of the past, present, and future may be upheld.

source: །རིག་སྔགས་དང་། གསང་སྔགས་ཀྱི་གཞི་འདི་དག་གིས་ནི་རྩོད་པའི་བདག་པོ་བདུད་ཐམས་ཅད་ཚར་གཅོད་པར་འགྱུར་རོ།
en: Through these words of the mantra, the secret mantra, all māras who raise objections can be defeated.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚངས་པ་ཀུན་དུ་སྣང་བ་ཞེས་བྱ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བགྱི།
en: Then Brahmā Fully Illuminating said to the Blessed One, “Blessed One, I will also uphold this Dharma teaching.

source: བཅང་བར་བགྱི།
en: I will bear it.

source: རྒྱས་པར་བགྱིའོ།
en: I will propagate it.

source: བཅོམ་ལྡན་འདས་བྱས་པ་གཟོ་བ་དང་། བྱས་པ་ཚོར་བ་ནི་དཀར་པོའི་ཆོས་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལས་བསྔགས་པའི་སླད་དུའོ།
en: Because, Blessed One, I wish to repay your past deeds and to be mindful of those deeds. I do it in order to praise the virtuous Dharma, the well-spoken Dharma and Vinaya.

source: །བཅོམ་ལྡན་འདས་བདག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བྱས་པ་གཟོ་བ་དང་། བྱས་པ་ཚོར་བ་རྗེས་སུ་དྲན་ཞིང་རྗེས་སུ་བསྲུང་སྟེ།
en: Blessed One, I wish to repay the kindness of the Thus-Gone One, be mindful of his deeds, remember them, and protect his teaching.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་ཚུལ་འདི་གཟུང་བར་བགྱི།
en: I will uphold the Thus-Gone One’s Dharma and protect it.”

source: ཡོངས་སུ་བསྲུང་བར་བགྱིའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་བུ་བསོད་ནམས་འཕགས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་དེ་བཞིན་གཤེགས་པའི་ཆོས་བཟུང་ན། བསོད་ནམས་ཇི་ཙམ་ཞིག་སྐྱེད་པར་འགྱུར་ལགས།
en: Then the god Noble Merit asked the Blessed One, “Blessed One, if noble sons or daughters uphold the Thus-Gone One’s Dharma, how much merit will they generate?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: The Blessed One then spoke the following verses in reply to the god Noble Merit: “If one person were to fill with jewels

source: སངས་རྒྱས་སྤྱན་གྱིས་ཕྱོགས་བཅུ་ཡི། །ཞིང་རྣམས་ཇི་སྙེད་ངས་མཐོང་བ། །དེ་ཀུན་རིན་ཆེན་གང་བྱས་ནས།
en: All the fields that I can see with my buddha eye Throughout the ten directions,

source: །མི་གང་སྦྱིན་པ་སྦྱིན་བྱེད་ལ།
en: Making of them a gift of generosity, “And a second person were to sincerely uphold

source: །གང་ཞིག་འཇིག་རྟེན་མགོན་པོའི་ཆོས། །སྙིང་ནས་ཡོངས་སུ་འཛིན་བྱེད་ན།
en: The Dharma of the World Protector,

source: །དེ་བས་མི་དེའི་བསོད་ནམས་ནི། །ཤིན་ཏུ་མང་དུ་འཕེལ་བར་འགྱུར།
en: The merit of this latter person would far exceed The merit of the former person.

source: །བསྐལ་པའི་བར་དུ་བཞུགས་ནས་ནི།
en: “Even if I stayed for an entire eon

source: །དཔེ་རྣམས་བསྟན་པས་བཤད་ན་ཡང་།
en: Trying to explain it using analogies, I could never finish describing

source: །དམ་པའི་ཆོས་ནི་འཛིན་པ་ཡི། །བསོད་ནམས་ཟད་པར་ཡོང་མི་འགྱུར།
en: The merit of upholding the sublime Dharma.”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པ་ན་ལྷ་ཁྲག་ཁྲིག་བདུན་ཅུ་རྩ་དྲུག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་དྲུག་ཁྲི་ནི་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་སྐྱེས་སོ།
en: When this Dharma teaching was given, seven trillion six hundred billion gods developed the mind set on unsurpassed and perfect awakening. Sixty thousand bodhisattvas developed the acceptance that phenomena are unborn.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་དང་མཚན་མ་ཆེན་པོ་བཅྭ་བརྒྱད་དུ་རབ་ཏུ་གཡོས་པར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ།
en: The worlds of this great trichiliocosm shook in six ways with eighteen different features.

source: ཤར་ཕྱོགས་མཐོ་ན་ནུབ་ཕྱོགས་དམའ། ནུབ་ཕྱོགས་མཐོ་ན་ཤར་ཕྱོགས་དམའ། ལྷོ་ཕྱོགས་མཐོ་ན་བྱང་ཕྱོགས་དམའ། བྱང་ཕྱོགས་མཐོ་ན་ལྷོ་ཕྱོགས་དམའ། དབུས་མཐོ་ན་མཐའ་དམའ།
en: Thus, the east rose up and the west sank, the west rose up and the east sank, the south rose up and the north sank, the north rose up and the south sank, the center rose up and the periphery sank, the periphery rose up and the center sank.

source: མཐའ་མཐོ་ན་དབུས་དམའ་བར་གྱུར་ཏེ།
en: The world quivered, trembled, and quaked;

source: གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། འགུལ།
en: wobbled, rocked, and swayed;

source: རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ། ལྡེག །རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག །འཁྲུགས། རབ་ཏུ་འཁྲུགས།
en: vibrated, shuddered, and reeled; rattled, shook, and convulsed;

source: ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས། འུར་འུར། རབ་ཏུ་འུར་འུར།
en: clattered, rattled, and clanged;

source: ཀུན་ཏུ་རབ་ཏུ་འུར་འུར། ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ།
en: boomed, thundered, and roared.

source: ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །སྣང་བ་ཆེན་པོས་ཀྱང་འཇིག་རྟེན་ཁྱབ་པར་གྱུར་ཏོ། །མེ་ཏོག་གི་ཆར་ཆེན་པོ་ཡང་བབ་བོ།
en: A great light filled the world. A shower of flowers fell.

source: །སིལ་སྙན་དག་ཀྱང་མ་དཀྲོལ་བར་རང་འཁྲོལ་ཞིང་སིལ་སྙན་དང་། གླུའི་དབྱངས་དེ་དག་ལས་ཀྱང་སྒྲ་འདི་ལྟ་བུ་བྱུང་སྟེ།
en: Instruments sounded without being played. From the tunes of the instruments the following sound rang out:

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པར་བྱིན་གྱིས་བརླབས་སོ།
en: “The Blessed One has consecrated this Dharma teaching to be impervious to all attacks of adversaries.

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྣམ་པར་དཀྲུག་ཏུ་མེད་པའི་ཚུལ་དུ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཕྱག་རྒྱས་ལེགས་པར་བཏབ་བོ་ཞེས་བྱུང་ངོ་།
en: This Dharma teaching has been stamped with the seal of the realm of phenomena so as to be unshakable.”

source: །ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཁྱབ་པར་མུ་ཏིག་གི་ཆར་ཆེན་པོ་ཕབ་བོ།
en: Nāga King Sāgara also cast down a shower of pearls that filled all the worlds of the great trichiliocosm.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ལ། གཞན་དག་ལ་ཡང་རྒྱས་པར་ཡང་དག་པར་སྟོན་ཅིག །གསོལ་པ།
en: The Blessed One then said to Venerable Ānanda, “Ānanda, you must uphold this Dharma teaching and teach it extensively to others.”

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བདག་གིས་གཟུང་ལགས་ན། བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: “Blessed One, if I am to uphold this Dharma teaching, what is its name?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: How shall I uphold it?”

source: དེའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །ཀླུའི་བདག་པོའི་གཟུངས་ཀྱི་ལེའུ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །རིན་པོ་ཆེ་ཀུན་ལས་བཏུས་པའི་ཆོས་ཀྱི་སྒོ་ཡོངས་སུ་དག་པའི་ལེའུ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: The Blessed One answered, “To answer your question, you should name this Dharma teaching The Questions of the Nāga King Sāgara . It is also called The Nāga Lord’s Dhāraṇī . You should also uphold it as The Pure Dharma Door: The Collection of All Jewels

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་དཔལ་གྱི་གཟི་བརྗིད་དང་། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དང་། ཕྱོགས་བཅུ་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་དང་། འཁོར་དེ་དག་ཐམས་ཅད་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: Once the Blessed One said this, Venerable Ānanda, Nāga King Sāgara, Nāga King Anavatapta, Nāga King Sāgara’s son Glorious Splendor, King Ajātaśatru, the bodhisattvas who had gathered from the ten directions, the entire assembly, and the world with its gods, humans, asuras, and gandharvas all rejoiced and praised what the Blessed One had taught.

source: །།འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This completes the noble Great Vehicle sūtra “The Questions of the Nāga King Sāgara.”

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། པྲཛྙཱ་བདྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།
en: It was translated, proofed, and finalized by the Indian preceptors Jinamitra and Prajñāvarman and the editor-translator Bandé Yeshé Dé and others.
